{
  "TITLE": "Frontend Entwickler",
  "NAME": "Dennis Schwarz",
  "COUNTRY": "Deutschland",
  "ABOUT_ME": "Über mich",
  "SKILLS": "Fähigkeiten",
  "PROJECTS": "Projekte",
  "CHECK_MY_WORK": "Sehen Sie sich meine Arbeit an",
  "CONTACT_ME": "Kontaktieren Sie mich",
  "OPEN_TO_WORK": "Offen für Arbeit",
  "MARQUEE_INFO": "Verfügbar für Remote-Arbeit",
  "BASED_IN": "Wohnhaft im Saarland",
  "WHO_I_AM": "Wer bin ich",
  "ABOUT_ME_INFO": "Hallo, ich bin ein deutschsprachiger Frontend-Entwickler mit Sitz in Neunkirchen Saar. Motiviert durch die grenzenlosen Möglichkeiten in der IT, bin ich begeistert davon, visuell fesselnde und intuitive Webseiten und Anwendungen zu entwickeln.",
  "LOCATION": "Ich bin flexibel, was das Arbeitsumfeld angeht, und kann sowohl vor Ort im Saarland als auch Remote effektiv arbeiten.",
  "COQNITION": "Ich bin aufgeschlossen und immer auf der Suche nach persönlichen Herausforderungen, um meine Kenntnisse und Fähigkeiten ständig zu verbessern.",
  "QUALITY": "In meinem Beruf geht es beim Programmieren nicht nur um das Schreiben von Code; es ist eine kreative Form der Problemlösung. Ich bin stolz auf meine Fähigkeit, komplexe technische Herausforderungen in einfache, benutzerfreundliche Lösungen zu destillieren. Auf diese Weise helfe ich Ihnen, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken.",
  "TECHNOLOGIES": "Technologien",
  "SKILL_SET": "Qualifikationen",
  "JOURNEY": "Auf meinem Weg habe ich an verschiedenen Projekten gearbeitet und dabei eine Reihe von Frontend-Technologien und Konzepten eingesetzt. Ich bin offen für neue Technologien und Methoden, um meine Fähigkeiten kontinuierlich zu verbessern und in der sich ständig weiterentwickelnden Landschaft der Webentwicklung vorne zu bleiben.",
  "YOU_NEED": "Sie brauchen",
  "ANOTHER_SKILL": "eine weitere Fähigkeit?",
  "SKILL_SET_CONTACT_ME": "Nehmen Sie Kontakt mit mir auf, ich freue mich darauf, mein bisheriges Wissen zu erweitern.",
  "SKILL_SET_TOOLTIP": "Ich habe ein besonderes Interesse am Lernen",
  "LETS_TALK": "Lassen Sie uns reden",
  "FEATURED_PROJECTS": "Ausgewählte Projekte",
  "EXPLORE": "Entdecken Sie hier eine Auswahl meiner Arbeiten - Interagieren Sie mit dem Projekt, um meine Fähigkeiten in Aktion zu sehen.",
  "PROJECT_ABOUT": "Worum geht es bei diesem Projekt?",
  "PROJECT_JOIN": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
  "PROJECT_SHARKIE": "Platformer-Spiel, inspiriert von klassischen Arcade-Spielen. Spiele als Huhn und überwinde verschiedene Hindernisse.",
  "PROJECT_DA_BUBBLE": "Ein mit Angular und Firebase entwickeltes Projektmanagement-Tool mit Funktionen zur Verfolgung von Projektfortschritt und Aufgaben.",
  "PROJECT_NEXT": "Nächstes Projekt",
  "COLLEAGUES_ABOUT_ME": "Was meine Kollegen über mich sagen",
  "COLLEAGUE_H_JANISCH": "Dennis hat sich als zuverlässiger Partner der Gruppe erwiesen. Seine technischen Fähigkeiten und sein proaktiver Ansatz waren entscheidend für den Erfolg unseres Projekts.",
  "COLLEAGUE_T_SCHULZ": "Ich hatte das Glück, mit Dennis an einem Projekt zu arbeiten. Er blieb immer ruhig und sorgte dafür, dass unser Team für den Erfolg gerüstet war.",
  "COLLEAGUE_P_BRAUN": "Neben der effizienten Arbeitsweise von Dennis zeigte er auch ein starkes Engagement für das Team.",
  "WORK_TOGETHER": "Lassen Sie uns zusammenarbeiten",
  "PROBLEM_TO_SOLVE": "Haben Sie ein Problem zu lösen?",
  "CONTACT_ME_FORM_INFO": "Kontaktieren Sie mich über dieses Formular, ich bin daran interessiert, von Ihnen zu hören, Ihre Ideen zu kennen und mit meiner Arbeit zu Ihren Projekten beizutragen.",
  "CONTACT_ME_FORM_INFO_NEED": "Benötigen Sie einen Frontend-Entwickler?",
  "CONTACT_ME_FORM_NAME": "Wie ist Ihr Name?",
  "CONTACT_ME_FORM_NAME_PLACEHOLDER": "Ihr Name wird hier eingetragen",
  "CONTACT_ME_FORM_EMAIL": "Wie lautet Ihre E-Mail?",
  "CONTACT_ME_FORM_EMAIL_PLACEHOLDER": "ihremail@email.de",
  "CONTACT_ME_FORM_MESSAGE": "Wie kann ich Ihnen helfen?",
  "CONTACT_ME_FORM_MESSAGE_PLACEHOLDER": "Hallo Dennis, ich bin interessiert an ...",
  "CONTACT_ME_FORM_PRIVACY_POLICY_INFO_1": "Ich habe die",
  "CONTACT_ME_FORM_PRIVACY_POLICY_INFO_2": "gelesen und erkläre mich mit der Verarbeitung meiner Daten wie beschrieben einverstanden.",
  "CONTACT_ME_FORM_ERROR_NAME": "Ihr Name wird benötigt.",
  "CONTACT_ME_FORM_ERROR_EMAIL": "Ihre E-Mail wird benötigt.",
  "CONTACT_ME_FORM_ERROR_MESSAGE": "Was möchten Sie entwickeln?",
  "CONTACT_ME_FORM_PRIVACY_POLICY": "Bitte akzeptieren Sie die Datenschutzbestimmungen.",
  "SEND_MESSAGE": "Nachricht absenden",
  "FRONTEND_DEVELOPER": "Frontend-Entwickler",
  "BACKEND_DEVELOPER": "Backend-Entwickler",
  "FOOTER_DEVELOPER": "Web-Entwickler",
  "PRIVACY_POLICY": "Datenschutzerklärung",
  "LEGAL_NOTICE": "Impressum",
  "RESPONSIBLE": "1. Verantwortlicher",
  "RESPONSIBLE_TEXT": "Verantwortlich für die Datenverarbeitung auf dieser Website ist:\n\n[Dennis Schwarz]\n[66539 Neunkirchen Saar]\n[schwarzdennis1995@gmail.com]",
  "DATA_COLLECTION": "2. Erhebung und Speicherung personenbezogener Daten sowie Art und Zweck der Verwendung",
  "DATA_COLLECTION_WEBSITE_TITLE": "a) Beim Besuch der Website",
  "DATA_COLLECTION_WEBSITE_TEXT": "Beim Aufrufen unserer Website werden durch den auf deinem Endgerät zum Einsatz kommenden Browser automatisch Informationen an den Server unserer Website gesendet. Diese Informationen werden temporär in einem sogenannten Logfile gespeichert. Folgende Informationen werden dabei ohne dein Zutun erfasst und bis zur automatisierten Löschung gespeichert:",
  "IP_ADDRESS": "IP-Adresse des anfragenden Rechners,",
  "ACCESS_TIME": "Datum und Uhrzeit des Zugriffs,",
  "FILE_NAME_URL": "Name und URL der abgerufenen Datei,",
  "REFERRER_URL": "Website, von der aus der Zugriff erfolgt (Referrer-URL),",
  "BROWSER_OS_PROVIDER": "verwendeter Browser und ggf. das Betriebssystem deines Rechners sowie der Name deines Access-Providers.",
  "DATA_COLLECTION_PURPOSES": "Diese Daten werden zu folgenden Zwecken verarbeitet:",
  "PURPOSE_LIST_1": "Gewährleistung eines reibungslosen Verbindungsaufbaus der Website,",
  "PURPOSE_LIST_2": "Gewährleistung einer komfortablen Nutzung unserer Website,",
  "PURPOSE_LIST_3": "Auswertung der Systemsicherheit und -stabilität sowie",
  "PURPOSE_LIST_4": "zu weiteren administrativen Zwecken.",
  "LEGAL_BASE": "Die Rechtsgrundlage für die Datenverarbeitung ist Art. 6 Abs. 1 S. 1 lit. f DSGVO. Unser berechtigtes Interesse folgt aus oben aufgelisteten Zwecken zur Datenerhebung. In keinem Fall verwenden wir die erhobenen Daten zu dem Zweck, Rückschlüsse auf deine Person zu ziehen.",
  "CONTACT_FORM_TITLE": "b) Bei Nutzung unseres Kontaktformulars",
  "CONTACT_FORM_TEXT": "Wenn du uns per Kontaktformular eine Nachricht sendest, werden folgende personenbezogene Daten von uns verarbeitet:",
  "CONTACT_FORM_NAME": "Deinen Namen,",
  "CONTACT_FORM_EMAIL": "Deine E-Mail-Adresse,",
  "CONTACT_FORM_MESSAGE": "Deine Nachricht im Freitextfeld.",
  "CONTACT_FORM_PROCESSING": "Die Verarbeitung dieser Daten erfolgt auf Grundlage deiner freiwilligen Einwilligung gemäß Art. 6 Abs. 1 S. 1 lit. a DSGVO. Deine E-Mail-Adresse wird ausschließlich dazu verwendet, um deine Anfrage zu bearbeiten und zu beantworten. Ohne diese Angabe können wir deine Anfrage leider nicht bearbeiten.",
  "CONTACT_FORM_USAGE": "Die im Kontaktformular angegebenen Daten werden nur für die Bearbeitung deiner Anfrage verwendet und nicht an Dritte weitergegeben.",
  "DATA_STORAGE_DELETION": "3. Speicherung und Löschung der Daten",
  "DATA_STORAGE_DELETION_TEXT": "Deine Daten werden nur so lange gespeichert, wie es für die Bearbeitung deiner Anfrage erforderlich ist. Sobald der Zweck der Datenspeicherung entfällt oder du deine Einwilligung zur Datenverarbeitung widerrufst, werden deine Daten gelöscht, sofern keine gesetzlichen Aufbewahrungsfristen entgegenstehen.",
  "DATA_SHARING": "4. Weitergabe von Daten",
  "DATA_SHARING_TEXT": "Eine Übermittlung deiner persönlichen Daten an Dritte findet grundsätzlich nicht statt, es sei denn:",
  "DATA_SHARING_LIST_1": "Du hast hierzu ausdrücklich deine Einwilligung erteilt (Art. 6 Abs. 1 S. 1 lit. a DSGVO),",
  "DATA_SHARING_LIST_2": "die Weitergabe ist zur Erfüllung eines Vertrags mit dir erforderlich (Art. 6 Abs. 1 S. 1 lit. b DSGVO),",
  "DATA_SHARING_LIST_3": "die Weitergabe ist zur Erfüllung einer rechtlichen Verpflichtung erforderlich (Art. 6 Abs. 1 S. 1 lit. c DSGVO) oder",
  "DATA_SHARING_LIST_4": "die Weitergabe erfolgt aufgrund unseres berechtigten Interesses oder des berechtigten Interesses eines Dritten (Art. 6 Abs. 1 S. 1 lit. f DSGVO).",
  "YOUR_RIGHTS": "5. Deine Rechte",
  "YOUR_RIGHTS_TEXT": "Du hast das Recht:",
  "YOUR_RIGHTS_LIST_1": "gemäß Art. 15 DSGVO Auskunft über deine von uns verarbeiteten personenbezogenen Daten zu verlangen,",
  "YOUR_RIGHTS_LIST_2": "gemäß Art. 16 DSGVO unverzüglich die Berichtigung unrichtiger oder Vervollständigung deiner bei uns gespeicherten personenbezogenen Daten zu verlangen,",
  "YOUR_RIGHTS_LIST_3": "gemäß Art. 17 DSGVO die Löschung deiner bei uns gespeicherten personenbezogenen Daten zu verlangen, soweit nicht die Verarbeitung zur Erfüllung einer rechtlichen Verpflichtung oder zur Ausübung eines Rechtsanspruchs erforderlich ist,",
  "YOUR_RIGHTS_LIST_4": "gemäß Art. 18 DSGVO die Einschränkung der Verarbeitung deiner personenbezogenen Daten zu verlangen,",
  "YOUR_RIGHTS_LIST_5": "gemäß Art. 20 DSGVO deine personenbezogenen Daten in einem strukturierten, gängigen und maschinenlesbaren Format zu erhalten oder die Übermittlung an einen anderen Verantwortlichen zu verlangen und",
  "YOUR_RIGHTS_LIST_6": "gemäß Art. 7 Abs. 3 DSGVO deine einmal erteilte Einwilligung jederzeit zu widerrufen.",
  "RIGHT_TO_WITHDRAW": "6. Widerruf der Einwilligung",
  "RIGHT_TO_WITHDRAW_TEXT": "Du hast das Recht, deine Einwilligung zur Verarbeitung deiner Daten jederzeit zu widerrufen. Der Widerruf ist schriftlich oder per E-Mail an uns zu richten. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt.",
  "CHANGES_TO_POLICY": "7. Änderungen dieser Datenschutzerklärung",
  "CHANGES_TO_POLICY_TEXT": "Wir behalten uns vor, diese Datenschutzerklärung anzupassen, um den aktuellen rechtlichen Anforderungen zu entsprechen oder um Änderungen unserer Leistungen in der Datenschutzerklärung umzusetzen. Für deinen erneuten Besuch gilt dann die neue Datenschutzerklärung.",
  "LEGAL_NOTICE_PARAGRAPH": "Angaben gemäß § 5 TMG",
  "CONTACT": "Kontakt",
  "RESPONSIBLE_PARAGRAPH": "Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV",
  "LIABILITY_FOR_CONTENT": "Haftung für Inhalte",
  "LIABILITY_FOR_CONTENT_TEXT_1": "Als Diensteanbieter sind wir gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 TMG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen.",
  "LIABILITY_FOR_CONTENT_TEXT_2": "Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.",
  "LIABILITY_FOR_LINKS": "Haftung für Links",
  "LIABILITY_FOR_LINKS_TEXT_1": "Unser Angebot enthält Links zu externen Websites Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar.",
  "LIABILITY_FOR_LINKS_TEXT_2": "Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.",
  "COPYRIGHT": "Urheberrecht",
  "COPYRIGHT_TEXT_1": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet.",
  "COPYRIGHT_TEXT_2": "Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Solltest du trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.",
  "PRIVACY_POLICY_TEXT_1": "Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder E-Mail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne deine ausdrückliche Zustimmung nicht an Dritte weitergegeben.",
  "PRIVACY_POLICY_TEXT_2": "    Wir weisen darauf hin, dass die Datenübertragung im Internet (z. B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich."
}

